In [ ]:
# 데이터 불러오기

In [1]:
import pandas as pd

In [2]:
sales = pd.read_csv('sales.csv')

In [10]:
sales

               date  shop_id  item_id  item_price  item_cnt_day
0        02.01.2013       59    22154      999.00           1.0
1        03.01.2013       25     2552      899.00           1.0
2        05.01.2013       25     2552      899.00          -1.0
3        06.01.2013       25     2554     1709.05           1.0
4        15.01.2013       25     2555     1099.00           1.0
...             ...      ...      ...         ...           ...
2935844  10.10.2015       25     7409      299.00           1.0
2935845  09.10.2015       25     7460      299.00           1.0
2935846  14.10.2015       25     7459      349.00           1.0
2935847  22.10.2015       25     7440      299.00           1.0
2935848  03.10.2015       25     7460      299.00           1.0

[2935849 rows x 5 columns]

item_cnt_day: 하루에 팔린 물건의 양

In [ ]:
# 데이터가 어떻게 구성 되어있는지 살펴보기

In [3]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 5 columns):
 #   Column        Dtype
---  ------        -----
 0   date          object
 1   shop_id       int64
 2   item_id       int64
 3   item_price    float64
 4   item_cnt_day  float64
dtypes: float64(2), int64(2), object(1)
memory usage: 112.0+ MB

In [4]:
sales.head()

         date  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013       59    22154      999.00           1.0
1  03.01.2013       25     2552      899.00           1.0
2  05.01.2013       25     2552      899.00          -1.0
3  06.01.2013       25     2554     1709.05           1.0
4  15.01.2013       25     2555     1099.00           1.0

In [ ]:
# 데이터 결측값 확인하기: 이 df에 결측값이 없다는 것을 확인함.

In [5]:
sales.isnull().sum()

date            0
shop_id         0
item_id         0
item_price      0
item_cnt_day    0
dtype: int64

In [31]:
#날짜는 어떻게 보나?
date2 = sales['date'].unique()

In [33]:
sales.sort_values('date')

               date  shop_id  item_id  item_price  item_cnt_day
16164    01.01.2013       28    11613      1499.0           1.0
101474   01.01.2013       51    10283       667.0           1.0
10197    01.01.2013       19     2828       499.0           1.0
101457   01.01.2013       51    10390       150.0           1.0
101455   01.01.2013       51    10591       110.0           1.0
...             ...      ...      ...         ...           ...
2263531  31.12.2014       10    15784       195.0           1.0
2238358  31.12.2014       31    18624       499.0           1.0
2238360  31.12.2014       31    18622       169.0           1.0
2210313  31.12.2014       59     9412       299.0           1.0
2239634  31.12.2014       34    15336       529.0           1.0

[2935849 rows x 5 columns]

In [ ]:
# 데이터 분석

In [6]:
sales['shop_id'].unique() #상점 종류 확인

array([59, 25, 24, 23, 19, 22, 18, 21, 28, 27, 29, 26,  4,  6,  2,  3,  7,
        0,  1, 16, 15,  8, 10, 14, 13, 12, 53, 31, 30, 32, 35, 56, 54, 47,
       50, 42, 43, 52, 51, 41, 38, 44, 37, 46, 45,  5, 57, 58, 55, 17,  9,
       49, 39, 40, 48, 34, 33, 20, 11, 36], dtype=int64)

In [7]:
sales['item_id'].unique() #상품 종류 확인

array([22154,  2552,  2554, ...,  7610,  7635,  7640], dtype=int64)

In [ ]:
# 상점 종류의 개수는?

In [8]:
len(sales['shop_id'].unique())

60

In [ ]:
# 상품 종류의 개수는?

In [9]:
len(sales['item_id'].unique())

21807

In [26]:
sales['item_id'].mean()

10197.227056977385

In [27]:
sales['item_id'].median()

9343.0

In [28]:
sales['item_id'].describe()

count    2.935849e+06
mean     1.019723e+04
std      6.324297e+03
min      0.000000e+00
25%      4.476000e+03
50%      9.343000e+03
75%      1.568400e+04
max      2.216900e+04
Name: item_id, dtype: float64

In [34]:
sales[sales['item_price'] <= 0]

              date  shop_id  item_id  item_price  item_cnt_day
484683  15.05.2013       32     2973        -1.0           1.0

In [35]:
sales[sales['item_price'] == sales['item_price'].max()]

               date  shop_id  item_id  item_price  item_cnt_day
1163158  13.12.2013       12     6066    307980.0           1.0

In [39]:
sales[sales['item_price'] == 6066]

Empty DataFrame
Columns: [date, shop_id, item_id, item_price, item_cnt_day]
Index: []

In [40]:
sales[sales['item_price'] == 2973]

Empty DataFrame
Columns: [date, shop_id, item_id, item_price, item_cnt_day]
Index: []

In [41]:
sales['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [42]:
sales['item_id'].value_counts()

20949    31340
5822      9408
17717     9067
2808      7479
4181      6853
         ...
579          1
19388        1
19326        1
6992         1
7640         1
Name: item_id, Length: 21807, dtype: int64

In [43]:
sales['item_cnt_day'].max()

2169.0

In [44]:
sales[sales['item_cnt_day'] == sales['item_cnt_day'].max()]

               date  shop_id  item_id  item_price  item_cnt_day
2909818  28.10.2015       12    11373    0.908714        2169.0

In [46]:
sales[sales['item_cnt_day'] <= 0]

               date  shop_id  item_id  item_price  item_cnt_day
2        05.01.2013       25     2552       899.0          -1.0
148      23.01.2013       25     2321       999.0          -1.0
175      07.01.2013       25     2199      1449.0          -1.0
807      02.01.2013       25     2330       599.0          -1.0
1041     13.01.2013       25     5034      1989.0          -1.0
...             ...      ...      ...         ...           ...
2934243  26.10.2015       25     3917       449.0          -1.0
2934462  18.10.2015       25     4896      6398.0          -1.0
2935263  05.10.2015       25    10039       249.0          -1.0
2935643  16.10.2015       25     7893      2990.0          -1.0
2935779  07.10.2015       25     7087       999.0          -1.0

[7356 rows x 5 columns]

In [ ]:
#시간이 있는 데이터 = 시계열 데이터

In [ ]:
# 상품 가격 최대값, 최소값 확인

In [12]:
sales['item_price'].max()

307980.0

In [13]:
sales[sales['item_price'] == sales['item_price'].max()]

               date  shop_id  item_id  item_price  item_cnt_day
1163158  13.12.2013       12     6066    307980.0           1.0

In [15]:
sales['item_price'].min()

-1.0

In [14]:
sales[sales['item_price'] == sales['item_price'].min()]

              date  shop_id  item_id  item_price  item_cnt_day
484683  15.05.2013       32     2973        -1.0           1.0

In [ ]:
# 상점값이 32이고, 상품이 2973에 가격이 0 이상인 행 출력

In [16]:
sales[(sales['shop_id'] == 32) & (sales['item_id'] == 2973) & (sales['item_price'] > 0)]

              date  shop_id  item_id  item_price  item_cnt_day
67427   29.01.2013       32     2973      2499.0           1.0
67428   25.01.2013       32     2973      2499.0           1.0
67429   22.01.2013       32     2973      2499.0           1.0
67430   21.01.2013       32     2973      2499.0           1.0
67431   18.01.2013       32     2973      2499.0           1.0
67432   17.01.2013       32     2973      2499.0           1.0
67433   15.01.2013       32     2973      2499.0           3.0
187844  05.02.2013       32     2973      2499.0           1.0
187845  14.02.2013       32     2973      2499.0           1.0
484682  23.05.2013       32     2973      1249.0           1.0
484684  06.05.2013       32     2973      2499.0           1.0
555026  05.06.2013       32     2973      1249.5           1.0

In [17]:
sales[(sales['shop_id'] == 32) & (sales['item_id'] == 2973) & (sales['item_price'] >= 0)]

              date  shop_id  item_id  item_price  item_cnt_day
67427   29.01.2013       32     2973      2499.0           1.0
67428   25.01.2013       32     2973      2499.0           1.0
67429   22.01.2013       32     2973      2499.0           1.0
67430   21.01.2013       32     2973      2499.0           1.0
67431   18.01.2013       32     2973      2499.0           1.0
67432   17.01.2013       32     2973      2499.0           1.0
67433   15.01.2013       32     2973      2499.0           3.0
187844  05.02.2013       32     2973      2499.0           1.0
187845  14.02.2013       32     2973      2499.0           1.0
484682  23.05.2013       32     2973      1249.0           1.0
484684  06.05.2013       32     2973      2499.0           1.0
555026  05.06.2013       32     2973      1249.5           1.0

In [ ]:
# 상품아이디 중 많이 팔린 갯수

In [19]:
group_item = sales.groupby('item_id')

In [21]:
group_item['item_cnt_day'].sum()

item_id
0           1.0
1           6.0
2           2.0
3           2.0
4           1.0
          ...
22165       2.0
22166     348.0
22167    1320.0
22168       6.0
22169       1.0
Name: item_cnt_day, Length: 21807, dtype: float64

In [ ]:
# 많이 팔린 순으로 정렬

In [22]:
group_item['item_cnt_day'].sum().sort_values(ascending=False)

item_id
20949    187642.0
2808      17245.0
3732      16642.0
17717     15830.0
5822      14515.0
           ...
7547          0.0
13474        -1.0
18062        -1.0
11871        -1.0
1590        -11.0
Name: item_cnt_day, Length: 21807, dtype: float64

In [ ]:
sales

In [ ]:
sales.describe()

In [ ]:
sales.value_counts()